/*leetcode中算法的测试样板
*/
#include<iostream>
#include<vector>
#include<unordered_map>
#include<string>
#include<queue>
using namespace std;
// -----------------------------------------question--------------------------
// 在这里尝试的是建立DPtable的解法，很容易知道连个维度分别是s和p；
// 思考的角度是，表示在第si个元素和第pi个元素之前的字符串是否还是匹配的。
// -----------------------------------------ans--------------------------------

// -----------------------------------------test--------------------------------
// 在这个地方编写测试样例并进行测试；
int main()
{
    std::cin.get();
}